## =========================================
## 컨테이너 자료형- [5] Set
##
## 
## - 중복데이터는 저장되지 않음
## - 원소/ 요소 식별용 인덱스 없음
## - 표현 방식: {원소1, 원소2, ..., 원소n}
## - 빈 집합: {}=> 빈 dict, set()=> 빈 set
## =========================================
##
## -------------------------------------------
## Set 생성
## -------------------------------------------
dataSet={1,3, 5, 6, 7, 2,1, 5}
print(f"dataset: {len(dataSet)}개, {type(dataSet)}, {dataSet}")

## -------------------------------------------
## 연산자: 산술 연산자 덧셈+ => set+set : 미지원 기능
## -------------------------------------------

# new_data= dataSet+ {11, 33, 9, 7}
# print(f"new_data: {len(new_data)}개, {type(new_data)}, {new_data}") 



## -------------------------------------------
## 연산자: 산술 연산자 곱셈* => set* int : 미지원 기능
## => 원한다면 형변환 필요
## -------------------------------------------

# new_data= dataSet*2
# print(f"new_data: {len(new_data)}개, {type(new_data)}, {new_data}") 
