## =========================================
## 컨테이너 자료형- [5] Set
##
## 
## - 중복데이터는 저장되지 않음
## - 원소/ 요소 식별용 인덱스 없음
## - 표현 방식: {원소1, 원소2, ..., 원소n}
## - 빈 집합: {}=> 빈 dict, set()=> 빈 set
## =========================================
##
## -------------------------------------------
## Set 생성
## -------------------------------------------
dataSet={1,1,1,1,1,1,1,1,1}
print(f"dataset: {len(dataSet)}개, {type(dataSet)}, {dataSet}")

dataSet={1, 12,5,6, 99}
print(f"dataset: {len(dataSet)}개, {type(dataSet)}, {dataSet}")
